[
    {
        "id": 1,
        "balance": "$485",
        "picture": "https://image.shutterstock.com/image-vector/javascript-programming-language-script-code-260nw-1062509657.jpg",
        "lecture": 11,
        "Quiz": 11,
        "category": "JavaScript",
        "Duration": "10 week",
        "Language": "English",
        "rating": 4.8,
        "totalView": 1350,
        "title": "JavaScript for Beginners Specialization",
        "details": "Working with a Code Editor, Intro of Selection Control Structures, How to Create Loops, and Understanding Core Programming Structures,introduces learners to the popular jQuery library and explores the syntactical differences between JavaScript and jQuery using small projects. "
    },
    {
        "id": 2,
        "balance": "$385",
        "picture": "https://play-lh.googleusercontent.com/a2NazRVOHSG7ujMkO1YENlUARt0rZul9ow20sAtqoc1oBEGZxk3YjlXb43lhCwxhmUY",
        "lecture": 7,
        "Quiz": 10,
        "category": "WordPress",
        "Duration": "1 week",
        "Language": "English",
        "rating": 4.6,
        "totalView": 1750,
        "title": "Build a Full Website using WordPress",
        "details": "You will learn how to create a website utilizing themes and plug-ins using the web creation tool. You’ll have a virtual space to showcase your business with customers who want to stay connected."
    },
    {
        "id": 3,
        "balance": "$285",
        "picture": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Node.js_logo.svg/1200px-Node.js_logo.svg.png",
        "lecture": 12,
        "Quiz": 16,
        "category": "NodeJS",
        "Duration": "1.5 week",
        "Language": "English",
        "rating": 4.4,
        "totalView": 1150,
        "title": "Server-side Development with NodeJS, Express and MongoDB",
        "details": "This course deals with all things server-side. We base the entire course around the NodeJS platform. We start with a brief overview of the Web protocols: HTTP and HTTPS. We examine NodeJS and NodeJS modules: Express for building web servers. On the database side, we review basic CRUD operations, NoSQL databases, in particular MongoDB and Mongoose for accessing MongoDB from NodeJS. We examine the REST concepts and building a RESTful API. We touch upon authentication and security. Finally we review backend as a service (BaaS) approaches, including mobile BaaS, both open-source and commercial BaaS services."
    },
    {
        "id": 4,
        "balance": "$455",
        "picture": "https://www.datocms-assets.com/45470/1631110818-logo-react-js.png",
        "lecture": 7,
        "Quiz": 10,
        "category": "React",
        "Duration": "2 week",
        "Language": "English",
        "rating": 4.9,
        "totalView": 1750,
        "title": "Full-Stack Web Development with React Specialization",
        "details": "If you want to learn how to create apps for Android and iOS devices, this course is right for you. This program is taught by industry-recognized experts at Meta.Cross-platform mobile developers build and write code for apps that are hosted on mobile devices powered by multiple operating systems. They do everything from creating the app to debugging it after deployment. They design interactive and attractive user interfaces (UIs) to ensure the best possible end-user or customer experiences. "
    },
    {
        "id": 5,
        "balance": "$155",
        "picture": "http://p92.hu/binaries/content/gallery/p92website/technologies/htmlcssjs-overview.png",
        "lecture": 18,
        "Quiz": 20,
        "category": "HTML, CSS",
        "Duration": "1 week",
        "Language": "English",
        "rating": 4,
        "totalView": 3050,
        "title": "HTML, CSS, and Javascript for Web Developers",
        "details": "Do you realize that the only functionality of a web application that the user directly interacts with is through the web page? Implement it poorly and, to the user, the server-side becomes irrelevant! Today's user expects a lot out of the web page: it has to load fast, expose the desired service, and be comfortable to view on all devices: from a desktop computers to tablets and mobile phones."
    },
    {
        "id": 6,
        "balance": "$255",
        "picture": "",
        "lecture": 22,
        "Quiz": 27,
        "category": "Photography",
        "Duration": "2 week",
        "Language": "English",
        "rating": 4.5,
        "totalView": 1050,
        "title": "Photography Basics and Beyond: From Smartphone to DSLR Specialization",
        "details": "This Specialization covers a broad range of fundamental principles in photography, from camera control to principles of composition and creativity, providing you with a foundation for growth in making photographs you’ll be proud  the Capstone you will develop a final project of photographs related to your individual needs, whether practical or purely expressive, and share ongoing feedback with fellow learners."
    },
    {
        "id": 7,
        "balance": "$255",
        "picture": "https://cdn.mos.cms.futurecdn.net/gvQ9NhQP8wbbM32jXy4V3j.jpg",
        "lecture": 34,
        "Quiz": 40,
        "category": "networking",
        "Duration": "4 week",
        "Language": "English",
        "rating": 4.7,
        "totalView": 1150,
        "title": "Introduction to Networks and Cisco Devices",
        "details": "In this 2-hours guided project, you will identify different components such as end devices, intermediary devices, and connection media and simulate network topologies in the Packet Tracer, manage Cisco network devices using telnet, SSH, and Console connections, and secure access to Cisco devices using passwords and password encryption services by the end of this project, you will be able to use the Packet Tracer to create network topologies that are like the one you’re seeing on the screen, connect to network devices using telnet, SSH, and Console, and manage basic category added file security settings on Cisco devices."
    },
    {
        "id": 8,
        "balance": "$350",
        "picture": "https://cloudtechbd.net/wp-content/uploads/2017/10/PHP.jpg",
        "lecture": 55,
        "Quiz": 70,
        "category": "PHP",
        "Duration": "6 week",
        "Language": "English",
        "rating": 4.2,
        "totalView": 1550,
        "title": "Web Applications for Everybody Specialization",
        "details": "This Specialization is an introduction to building web applications for anybody who already has a basic understanding of responsive web design with JavaScript,  HTML, and CSS. Web Applications for Everybody is your introduction to web application development. You will develop web and database applications in PHP, using SQL for database creation, as well as functionality in JavaScript, jQuery, and JSON file convert."
    },
    {
        "id": 9,
        "balance": "$350",
        "picture": "https://lh5.googleusercontent.com/FRX_ktd3UDh0Zv9Tsbhh7apq-bQPCPJWJhgEONMpfLKpgV4-1zg7aGYFdc1GMK_WZ6bswKAvW_bDEhlQE0RAIHA_jYaMmRY-Err_8nUGgpkqbQz6OOJ8RpBmMSRoGV5dQleCu-TS",
        "lecture": 60,
        "Quiz": 70,
        "category": "Animation",
        "Duration": "5 week",
        "Language": "English",
        "rating": 4.1,
        "totalView": 1050,
        "title": "Introduction to Programming and Animation with Alice",
        "details": "We will be using Canva for this purpose and we will create a Promotional Video slide by slide. We will begin by creating video slides around the Customer’s pain points and introduce our Solutions. We will then persuade our target customers through USPs and Testimonials and finish the video with a Call to Action this line. "
    }
]